Repository: JiatangDong/openkoto
Catalog: openkoto-ios/Packages/OpenKotoKit/Sources/OKLocalization/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

# achievement.maxed
source: Maxed
ja: 達成
zh_hans: 已满级

# achievement.readingDays.title
source: Reading Days
ja: 読書日数
zh_hans: 阅读天数

# achievement.readingMinutes.title
source: Reading Time
ja: 読書時間
zh_hans: 阅读时长

# achievement.streak.title
source: Streak
ja: 連続学習
zh_hans: 连续打卡

# achievement.totalReviews.title
source: Reviews
ja: 復習マスター
zh_hans: 复习达人

# achievement.wordsCollected.title
source: Words Collected
ja: 単語収集
zh_hans: 收集生词

# achievement.wordsMastered.title
source: Mastered
ja: 習得
zh_hans: 已掌握

# ai.error.cancelled
source: Cancelled.
ja: キャンセルされました。
zh_hans: 已取消。

# ai.error.contentBlocked
source: Blocked by content policy.
ja: コンテンツポリシーによりブロックされました。
zh_hans: 被内容策略拦截。

# ai.error.insufficientBalance
source: Your provider account is out of credit. Top up or switch providers — retrying won't help.
ja: プロバイダーの残高が不足しています。チャージするか別のプロバイダーに切り替えてください。再試行しても解決しません。
zh_hans: 该服务商账户额度已用尽。请充值或换一个服务商——重试不会有帮助。

# ai.error.malformed
source: Could not parse the AI response.
ja: AI レスポンスを解析できませんでした。
zh_hans: 无法解析 AI 响应。

# ai.error.network
source: Network unavailable.
ja: ネットワークに接続できません。
zh_hans: 网络不可用。

# ai.error.notConfigured
source: No AI model configured. Add one in Settings.
ja: AI モデル未設定です。設定で追加してください。
zh_hans: 尚未配置 AI 模型，请在设置中添加。

# ai.error.rateLimited
source: Rate limited. Try again later.
ja: レート制限中です。後で再試行してください。
zh_hans: 请求过于频繁，请稍后重试。

# ai.error.server
source: Provider server error.
ja: プロバイダーのサーバーエラー。
zh_hans: 服务商服务器错误。

# ai.error.timeout
source: The model took too long to respond. Try again, or switch to a faster model.
ja: モデルの応答がタイムアウトしました。再試行するか、より速いモデルに切り替えてください。
zh_hans: 模型响应超时。可以重试，或换一个更快的模型。

# ai.error.unauthorized
source: Invalid API key or unauthorized.
ja: API キーが無効か未認証です。
zh_hans: API Key 无效或未授权。

# batch.scope.count
source: How many
ja: 処理する文数
zh_hans: 处理句数

# batch.scope.footer
source: Each sentence is one AI request. Already-processed sentences are skipped, and identical text explained elsewhere is reused for free.
ja: 1 文につき 1 回の AI リクエストです。処理済みの文はスキップされ、他で解説済みの同一文は無料で再利用されます。
zh_hans: 每句一次 AI 请求。已处理过的句子会跳过；别处已精讲过的相同原文会直接复用，不再花钱。

# batch.scope.pending
source: Will process
ja: 処理される数
zh_hans: 本次将处理

# batch.scope.sentenceNo%lld
source: Sentence %lld
ja: %lld 文目
zh_hans: 第 %lld 句

# batch.scope.sentences%lld
source: %lld sentences
ja: %lld 文
zh_hans: %lld 句

# batch.scope.start
source: Start
ja: 開始
zh_hans: 开始

# batch.scope.startAt
source: Starting from
ja: 開始位置
zh_hans: 起始句

# batch.scope.whole
source: Whole text
ja: 全文
zh_hans: 整篇

# book.batch.chapterScope
source: This chapter
ja: この章
zh_hans: 本章

# book.chapter.charCount%lld
source: %lld characters
ja: %lld 文字
zh_hans: %lld 字

# book.chapter.next
source: Next chapter
ja: 次の章
zh_hans: 下一章

# book.chapter.previous
source: Previous chapter
ja: 前の章
zh_hans: 上一章

# book.chapterCount%lld
source: %lld chapters
ja: %lld 章
zh_hans: 共 %lld 章

# book.empty.message
source: This book has no readable chapters.
ja: この本には読める章がありません。
zh_hans: 这本书没有可阅读的章节。

# book.empty.title
source: No chapters
ja: 章がありません
zh_hans: 没有章节

# book.mode.native
source: Learning mode
ja: 学習モード
zh_hans: 学习模式

# book.mode.original
source: Original layout
ja: 元のレイアウト
zh_hans: 原版排版

# book.mode.originalOnly.hint
source: This book is fixed-layout, so only the original view is available.
ja: この本は固定レイアウトのため、元のレイアウトでのみ読めます。
zh_hans: 这本书是固定版式，只能用原版模式阅读。

# book.originalFilesMissing
source: The book files are missing. Re-import to restore the original layout.
ja: 本のファイルが見つかりません。再インポートすると元のレイアウトに戻せます。
zh_hans: 书籍文件已丢失，重新导入可恢复原版排版。

# book.resume%lld%lld
source: Ch.%1$lld · %2$lld%%
ja: 第%1$lld章 · %2$lld%%
zh_hans: 第 %1$lld 章 · %2$lld%%

# book.resumeSpoken%lld
source: resume at chapter %lld
ja: 第%lld章から再開
zh_hans: 读到第 %lld 章

# book.toc
source: Contents
ja: 目次
zh_hans: 目录

# bookmark.add
source: Add bookmark
ja: しおりを追加
zh_hans: 加书签

# bookmark.approximate
source: Approximate position
ja: おおよその位置
zh_hans: 位置为近似

# bookmark.empty.message
source: Long-press a sentence to bookmark or highlight it.
ja: 文をロングプレスすると、しおりやハイライトを付けられます。
zh_hans: 长按句子即可加书签或划线。

# bookmark.empty.title
source: No bookmarks yet
ja: しおりがありません
zh_hans: 还没有书签

# bookmark.highlight
source: Highlight
ja: ハイライト
zh_hans: 划线

# bookmark.note
source: Note
ja: メモ
zh_hans: 备注

# bookmark.title
source: Bookmarks
ja: しおり
zh_hans: 书签

# common.add
source: Add
ja: 追加
zh_hans: 添加

# common.cancel
source: Cancel
ja: キャンセル
zh_hans: 取消

# common.close
source: Close
ja: 閉じる
zh_hans: 关闭

# common.delete
source: Delete
ja: 削除
zh_hans: 删除

# common.done
source: Done
ja: 完了
zh_hans: 完成

# common.save
source: Save
ja: 保存
zh_hans: 保存

# explanation.culture
source: Cultural Context
ja: 文化的背景
zh_hans: 文化背景

# explanation.explanation
source: Explanation
ja: 解説
zh_hans: 讲解

# explanation.grammar
source: Grammar
ja: 文法
zh_hans: 语法

# explanation.loading
source: Generating explanation…
ja: 解説を生成中…
zh_hans: 正在生成精讲…

# explanation.mode.explain
source: Explain
ja: 解説
zh_hans: 精讲

# explanation.mode.words
source: Words
ja: 単語
zh_hans: 查词

# explanation.retry
source: Retry
ja: 再試行
zh_hans: 重试

# explanation.speak
source: Speak
ja: 読み上げ
zh_hans: 朗读

# explanation.tips
source: Learning Tips
ja: 学習アドバイス
zh_hans: 学习建议

# explanation.translation
source: Translation
ja: 翻訳
zh_hans: 翻译

# explanation.vocabulary
source: Vocabulary
ja: 語彙
zh_hans: 词汇

# gloss.hint
source: Tap a word to look it up.
ja: 単語をタップすると意味を表示します。
zh_hans: 点一个词查它的意思。

# gloss.loading
source: Looking up…
ja: 検索中…
zh_hans: 正在查询…

# import.book.failed
source: Import failed
ja: 取り込みに失敗しました
zh_hans: 导入失败

# import.book.parsing
source: Importing book…
ja: 本を取り込んでいます…
zh_hans: 正在导入书籍…

# import.dropHint
source: Drop a .txt / .md file here
ja: ここに .txt / .md ファイルをドロップ
zh_hans: 将 .txt / .md 文件拖到此处

# import.error.corruptArchive
source: The file is damaged or not a valid EPUB.
ja: ファイルが壊れているか、有効な EPUB ではありません。
zh_hans: 文件已损坏，或不是有效的 EPUB。

# import.error.drm
source: This book is DRM-protected and cannot be opened.
ja: この本は DRM 保護されているため開けません。
zh_hans: 这本书有 DRM 保护，无法打开。

# import.error.emptyContent
source: No readable text was found in this file.
ja: このファイルに読める本文が見つかりませんでした。
zh_hans: 这个文件里没有可读正文。

# import.error.unsupportedFormat
source: This file type is not supported.
ja: このファイル形式には対応していません。
zh_hans: 不支持这种文件类型。

# import.field.content
source: Paste text here…
ja: ここに本文を貼り付け…
zh_hans: 在此粘贴正文…

# import.field.title
source: Title
ja: タイトル
zh_hans: 标题

# import.file.bookButton
source: Choose a book (EPUB / TXT)
ja: 本を選ぶ（EPUB / TXT）
zh_hans: 选择书籍（EPUB / TXT）

# import.file.button
source: Choose File
ja: ファイルを選択
zh_hans: 选择文件

# import.media.file
source: Video or audio
ja: 動画または音声
zh_hans: 视频或音频

# import.media.footer
source: Sentences are rebuilt from the subtitle timeline, so explanations always get whole sentences instead of subtitle fragments. Without a media file you still get a timed transcript to read.
ja: 字幕はタイムラインから文単位で組み直されるため、解説には断片ではなく完全な文が渡ります。メディアを選ばなくても、時間情報付きの文章として読めます。
zh_hans: 字幕会按时间轴重新拼成完整句子，精讲拿到的是整句而不是字幕碎片。不选媒体文件也可以，那就是一篇带时间轴的文稿。

# import.media.footer.asr
source: Pick a subtitle file if you have one. Otherwise choose just the media and generate subtitles on device afterwards. Either way, sentences are rebuilt from the timeline so explanations get whole sentences.
ja: 字幕ファイルがあれば選んでください。なければメディアだけ選び、後から端末内の音声認識で字幕を生成できます。どちらの場合もタイムラインから文単位で組み直されます。
zh_hans: 有字幕文件就选上；没有的话只选媒体，进去之后可以用本机语音识别生成字幕。两种方式都会按时间轴重新拼成完整句子，精讲拿到的是整句。

# import.media.optional
source: Optional
ja: 任意
zh_hans: 可选

# import.media.photoLibrary
source: Choose from Photos
ja: 写真から選ぶ
zh_hans: 从相册选择

# import.media.required
source: Required
ja: 必須
zh_hans: 必选

# import.media.subtitle
source: Subtitle file
ja: 字幕ファイル
zh_hans: 字幕文件

# import.method.file
source: File
ja: ファイル
zh_hans: 文件

# import.method.media
source: Video / Audio
ja: 動画・音声
zh_hans: 视频 / 音频

# import.method.paste
source: Paste
ja: 貼り付け
zh_hans: 粘贴文本

# import.title
source: New Material
ja: 新しい教材
zh_hans: 新建素材

# import.url.failed
source: Couldn't fetch this page. Check the URL and try again.
ja: このページを取得できませんでした。URL を確認して再試行してください。
zh_hans: 无法抓取该网页，请检查网址后重试。

# import.url.fetch
source: Fetch
ja: 取得
zh_hans: 抓取

# import.url.fetching
source: Fetching…
ja: 取得中…
zh_hans: 抓取中…

# lang.simplifiedChinese
source: Simplified Chinese
ja: 簡体字中国語
zh_hans: 简体中文

# lang.traditionalChinese
source: Traditional Chinese
ja: 繁体字中国語
zh_hans: 繁体中文

# library.empty.message
source: Import an article, a book or a video to start learning.
ja: 記事・本・動画をインポートして学習を始めましょう。
zh_hans: 导入文章、电子书或音视频，开始学习吧。

# library.empty.title
source: No Materials
ja: 教材がありません
zh_hans: 还没有学习素材

# library.import
source: Import
ja: インポート
zh_hans: 导入

# media.backToCurrent
source: Back to current
ja: 現在位置へ戻る
zh_hans: 回到当前

# media.blind.hidden
source: Subtitle hidden. Tap to reveal.
ja: 字幕は非表示です。タップで表示。
zh_hans: 字幕已隐藏，点按可揭晓。

# media.blind.off
source: Show subtitles
ja: 字幕を表示
zh_hans: 显示字幕

# media.blind.on
source: Hide subtitles
ja: 字幕を隠す
zh_hans: 隐藏字幕

# media.loop.start
source: Loop this sentence
ja: この文をリピート
zh_hans: 循环这一句

# media.loop.stop
source: Stop looping
ja: リピートを解除
zh_hans: 停止循环

# media.pause
source: Pause
ja: 一時停止
zh_hans: 暂停

# media.play
source: Play
ja: 再生
zh_hans: 播放

# media.rate
source: Speed
ja: 再生速度
zh_hans: 播放速度

# media.readAsArticle
source: Read as article
ja: 記事として読む
zh_hans: 当文章读

# media.shadowing.start
source: Shadowing mode
ja: シャドーイング
zh_hans: 跟读模式

# media.shadowing.stop
source: Exit shadowing
ja: シャドーイング終了
zh_hans: 退出跟读

# media.transcribe.done%lld
source: Done — %lld sentences
ja: 完了 — %lld 文
zh_hans: 完成——共 %lld 句

# media.transcribe.downloadingModel
source: Downloading language model…
ja: 言語モデルをダウンロード中…
zh_hans: 正在下载语言模型…

# media.transcribe.footer
source: Speech is recognized entirely on this device. Nothing is uploaded and no AI credits are used.
ja: 音声認識はすべて端末内で行われます。何もアップロードされず、AI クレジットも消費しません。
zh_hans: 语音识别完全在本机进行，不上传任何内容，也不消耗 AI 额度。

# media.transcribe.generate
source: Generate subtitles
ja: 字幕を生成
zh_hans: 生成字幕

# media.transcribe.keepOpen
source: Keep this screen open. Transcription stops if the app goes to the background.
ja: この画面を開いたままにしてください。バックグラウンドに切り替えると中断されます。
zh_hans: 请保持此页面打开。切到后台会中断转写。

# media.transcribe.language
source: Spoken language
ja: 話されている言語
zh_hans: 口语语种

# media.transcribe.preparing
source: Preparing audio…
ja: 音声を準備しています…
zh_hans: 正在准备音轨…

# media.transcribe.redo
source: Transcribe again
ja: 文字起こしをやり直す
zh_hans: 重新转写

# media.transcribe.running
source: Transcribing…
ja: 文字起こし中…
zh_hans: 正在转写…

# media.transcribe.start
source: Start
ja: 開始
zh_hans: 开始

# media.transcribe.title
source: Generate Subtitles
ja: 字幕を生成
zh_hans: 生成字幕

# media.unavailable
source: Media file is unavailable. The transcript is still readable.
ja: メディアファイルを開けません。文章はそのまま読めます。
zh_hans: 媒体文件不可用，文稿仍可阅读。

# menu.decreaseFontSize
source: Decrease Font Size
ja: 文字を小さく
zh_hans: 减小字号

# menu.increaseFontSize
source: Increase Font Size
ja: 文字を大きく
zh_hans: 增大字号

# menu.reading
source: Reading
ja: 読書
zh_hans: 阅读

# menu.togglePane
source: Show/Hide Explanation Pane
ja: 解説パネルの表示切替
zh_hans: 显示/隐藏精讲栏

# model.form.apiKey
source: API Key
ja: API キー

# model.form.apiKey.configured
source: Configured — enter to replace
ja: 設定済み — 入力で置換
zh_hans: 已配置 — 输入可替换

# model.form.apiKey.localOptional
source: Local providers may not require a key.
ja: ローカルプロバイダーはキー不要の場合があります。
zh_hans: 本地服务商可能无需 Key。

# model.form.baseURL
source: Custom Base URL
ja: カスタム Base URL
zh_hans: 自定义 Base URL

# model.form.baseURL.required
source: Required for this provider.
ja: このプロバイダーでは必須です。
zh_hans: 此服务商必填。

# model.form.cancel
source: Cancel
ja: キャンセル
zh_hans: 取消

# model.form.default
source: Default
ja: デフォルト
zh_hans: 默认

# model.form.http.warning
source: Local HTTP endpoint — traffic is unencrypted.
ja: ローカル HTTP エンドポイント — 通信は暗号化されません。
zh_hans: 本地 HTTP 端点 — 流量未加密。

# model.form.model
source: Model
ja: モデル
zh_hans: 模型

# model.form.name
source: Name
ja: 名前
zh_hans: 名称

# model.form.privacy
source: Privacy Policy
ja: プライバシーポリシー
zh_hans: 隐私政策

# model.form.privacy.note
source: Article text is sent to this provider to generate explanations.
ja: 解説生成のため本文がこのプロバイダーに送信されます。
zh_hans: 正文会发送给该服务商以生成精讲。

# model.form.provider
source: Provider
ja: プロバイダー
zh_hans: 服务商

# model.form.save
source: Save
ja: 保存
zh_hans: 保存

# model.form.setDefault
source: Set Default
ja: デフォルトに設定
zh_hans: 设为默认

# model.form.test
source: Test Connection
ja: 接続テスト
zh_hans: 测试连接

# model.form.test.success
source: Connection OK
ja: 接続成功
zh_hans: 连接成功

# onboarding.appLanguage.subtitle
source: Pick the language for the app interface.
ja: アプリの表示言語を選んでください。
zh_hans: 选择 App 界面使用的语言。

# onboarding.done.cta
source: Start Reading
ja: 読み始める
zh_hans: 开始阅读

# onboarding.done.subtitle
source: Here's what you chose. Enjoy your reading.
ja: 設定内容はこちら。読書を楽しんでください。
zh_hans: 这是你的选择，开始享受阅读吧。

# onboarding.done.summary.language
source: Languages
ja: 言語
zh_hans: 语言

# onboarding.done.summary.model
source: AI model
ja: AI モデル
zh_hans: AI 模型

# onboarding.done.summary.modelSkipped
source: Not set yet
ja: 未設定
zh_hans: 尚未设置

# onboarding.done.summary.theme
source: Theme
ja: テーマ
zh_hans: 皮肤

# onboarding.done.title
source: You're all set!
ja: 準備完了！
zh_hans: 一切就绪！

# onboarding.language.subtitle
source: AI will explain words and grammar in this language. You can change it anytime in Settings.
ja: AI はこの言語で単語と文法を解説します。あとで設定から変更できます。
zh_hans: AI 会用这种语言讲解生词和语法。之后随时可以在设置中修改。

# onboarding.language.title
source: Explanations in your language
ja: 解説はあなたの言語で
zh_hans: 用你的母语讲解

# onboarding.model.guide.compat.step1
source: Paste the Base URL from your provider (usually ends with /v1)
ja: プロバイダーの Base URL を貼り付ける（通常は /v1 で終わります）
zh_hans: 填入服务商给的 Base URL（通常以 /v1 结尾）

# onboarding.model.guide.compat.step2
source: Enter the model ID exactly as that provider names it
ja: そのプロバイダーで使われているモデル ID をそのまま入力
zh_hans: 填入该服务商使用的模型 ID（原样填写）

# onboarding.model.guide.compat.step3
source: Paste the API key it issued you, then tap Test
ja: 発行された API キーを貼り付けて、接続テストを実行
zh_hans: 粘贴它签发的 API Key，再点测试连接

# onboarding.model.guide.openConsole
source: Open the key console
ja: 公式サイトでキーを取得
zh_hans: 前往官网获取

# onboarding.model.guide.step1
source: Open the %@ key console
ja: %@ のキー管理ページを開く
zh_hans: 打开 %@ 的密钥控制台

# onboarding.model.guide.step2
source: Sign up (top up a small amount if required) and create a new API key
ja: 登録・ログインして（必要なら少額チャージ）、新しい API キーを作成
zh_hans: 注册登录（如需要可充值少量金额），创建一个新的 API Key

# onboarding.model.guide.step3
source: Copy the key and paste it above
ja: キーをコピーして上の入力欄に貼り付ける
zh_hans: 复制 Key，粘贴到上方输入框

# onboarding.model.guide.title
source: How to get an API key
ja: API キーの取得方法
zh_hans: 如何获取 API Key

# onboarding.model.skip
source: Set up later
ja: あとで設定
zh_hans: 暂时跳过

# onboarding.model.skip.note
source: You can add a model anytime in Settings → AI Models.
ja: 「設定 → AI モデル」からいつでも追加できます。
zh_hans: 随时可以在「设置 → AI 模型」中添加。

# onboarding.model.subtitle
source: Explanations run on your own API key. Pick a provider and paste a key — or set it up later.
ja: 解説はあなた自身の API キーで動きます。プロバイダーを選んでキーを貼り付けてください。あとで設定しても OK。
zh_hans: 讲解功能使用你自己的 API Key。选择一家服务商并粘贴 Key，也可以稍后再设置。

# onboarding.model.title
source: Connect an AI model
ja: AI モデルにつなぐ
zh_hans: 连接 AI 模型

# onboarding.provider.note.google
source: Free tier available — you can start without billing.
ja: 無料枠あり。課金なしで始められます。
zh_hans: 提供免费额度，无需付费即可开始使用。

# onboarding.provider.note.moonshot
source: Mainland China endpoint — account and key are separate from the global version.
ja: 中国本土向けエンドポイント。アカウントとキーはグローバル版と別です。
zh_hans: 中国大陆直连接口，账号与 Key 和国际版相互独立。

# onboarding.provider.note.openaiCompatible
source: Bring your own provider — any service with an OpenAI-compatible /chat/completions endpoint works.
ja: 自分のプロバイダーを使う — OpenAI 互換の /chat/completions に対応していれば何でも利用できます。
zh_hans: 自带服务商 — 只要提供 OpenAI 兼容的 /chat/completions 接口即可接入。

# onboarding.provider.note.openrouter
source: One key unlocks models from many different providers.
ja: 1 つのキーで多くのプロバイダーのモデルを利用可能。
zh_hans: 一个 Key 即可调用多家服务商的模型。

# onboarding.step.back
source: Back
ja: 戻る
zh_hans: 返回

# onboarding.step.continue
source: Continue
ja: 続ける
zh_hans: 继续

# onboarding.step.progress
source: Step %1$d of %2$d
ja: ステップ %1$d / %2$d
zh_hans: 第 %1$d 步，共 %2$d 步

# onboarding.theme.subtitle
source: Three hand-tuned themes, each with light and dark.
ja: 3 つのテーマ。ライト／ダークどちらにも対応。
zh_hans: 三套精心调校的主题，均支持浅色与深色模式。

# onboarding.theme.title
source: Pick your style
ja: スタイルを選ぶ
zh_hans: 挑一套喜欢的皮肤

# onboarding.welcome.cta
source: Get Started
ja: はじめる
zh_hans: 开始使用

# onboarding.welcome.page1.point1
source: EPUB and TXT books, split into chapters with your place remembered
ja: EPUB と TXT の本を自動で章分けし、読んだ位置を記憶
zh_hans: EPUB 与 TXT 电子书，自动分章、记住读到哪

# onboarding.welcome.page1.point2
source: Video and audio with subtitles — no subtitles? Generate them on device
ja: 動画と音声を字幕付きで。字幕がなければ端末内で生成
zh_hans: 视频与音频配字幕；没有字幕就用本机语音识别当场生成

# onboarding.welcome.page1.point3
source: Share web pages and text into OpenKoto from any app
ja: どのアプリからでもウェブページやテキストを共有
zh_hans: 从任何 App 把网页和文字分享进来

# onboarding.welcome.page1.point4
source: Search every word you have ever read, across the whole library
ja: ライブラリ全体を全文検索——読んだ一文をいつでも探せます
zh_hans: 整个资源库全文搜索，找回读过的任何一句

# onboarding.welcome.page1.title
source: Read what you actually like
ja: 好きなものを読む
zh_hans: 读你真正喜欢的东西

# onboarding.welcome.page2.point1
source: Text is split into sentences automatically — tap one to work on it
ja: 本文は自動で文単位に分割。タップした文から読み進める
zh_hans: 正文自动切成句子，点一句就读一句

# onboarding.welcome.page2.point2
source: Furigana and pinyin generated on device — no network, no cost, nothing uploaded
ja: ふりがなとピンインは端末内で生成。通信も費用も不要
zh_hans: 振假名与拼音在本机生成——不联网、不花钱、不上传

# onboarding.welcome.page2.point3
source: Switch between reflowed and original layout; progress and highlights follow
ja: リフローと原本レイアウトを切替可能。進捗もマーカーも共通
zh_hans: 原生与原版排版随时切换，进度、书签、划线两边通用

# onboarding.welcome.page2.title
source: Sentence by sentence
ja: 一文ずつ読む
zh_hans: 一句一句地读

# onboarding.welcome.page3.point1
source: Translation plus context, grammar and cultural notes for any sentence
ja: 文ごとの翻訳に加え、文脈・文法・文化背景も解説
zh_hans: 逐句翻译，并讲语境、语法与文化背景

# onboarding.welcome.page3.point2
source: Vocabulary and grammar points come out structured — save with one tap
ja: 語彙と文法事項を構造化して出力、ワンタップで保存
zh_hans: 生词与语法点结构化输出，一键收藏

# onboarding.welcome.page3.point3
source: Just one word? Tap it for a quick definition in context — far cheaper than a full explanation
ja: 一語だけ知りたい時はタップ——文脈つきの語義だけを安く引けます
zh_hans: 只想知道一个词？点它单查，带上下文的释义，比整句精讲便宜得多

# onboarding.welcome.page3.point4
source: Bring your own API key — requests go straight to the provider you choose. We run no server
ja: API キーはご自身のもの。リクエストは選んだ提供元へ直接——当方にサーバーはありません
zh_hans: 自带 API Key，请求直连你选的服务商——我们没有服务器

# onboarding.welcome.page3.title
source: Explanations in your language
ja: 母語で解説
zh_hans: 用你的母语讲解

# onboarding.welcome.page4.point1
source: FSRS-6 spaced repetition, the same scheduler as the desktop app
ja: FSRS-6 の間隔反復。デスクトップ版と同じアルゴリズム
zh_hans: FSRS-6 间隔重复，与桌面版同一套算法

# onboarding.welcome.page4.point2
source: Loop one sentence, slow it down without pitch shift, hide the subtitles and shadow it
ja: 一文リピート・音程を保ったまま速度変更・字幕を隠してシャドーイング
zh_hans: 单句循环、变速不变调，还能遮住字幕盲听跟读

# onboarding.welcome.page4.point3
source: Reading time, review curves and achievements
ja: 読書時間・復習カーブ・実績
zh_hans: 阅读时长、复习曲线与成就

# onboarding.welcome.page4.title
source: And actually remember it
ja: そして定着させる
zh_hans: 并且真的记住

# onboarding.welcome.point1
source: Import any article and read it sentence by sentence
ja: 好きな記事を取り込み、一文ずつ読み進める
zh_hans: 导入任意文章，逐句精读

# onboarding.welcome.point2
source: AI explains vocabulary and grammar in your language
ja: AI があなたの言語で語彙と文法を解説
zh_hans: AI 用你的母语讲解生词和语法

# onboarding.welcome.point3
source: Remember words for good with spaced repetition
ja: 間隔反復で単語をしっかり記憶
zh_hans: 间隔重复复习，把生词牢牢记住

# onboarding.welcome.subtitle
source: Learn a language by reading what you love.
ja: 好きなものを読みながら、ことばを学ぼう。
zh_hans: 读你喜欢的内容，学你想学的语言。

# onboarding.welcome.title
source: Welcome to OpenKoto
ja: OpenKoto へようこそ
zh_hans: 欢迎使用 OpenKoto

# reader.batch.cancel
source: Cancel
ja: キャンセル
zh_hans: 取消

# reader.batch.cancelling
source: Cancelling…
ja: キャンセル中…
zh_hans: 正在取消…

# reader.batch.explainAll
source: Explain Whole Text
ja: 全文を精読
zh_hans: 全文精讲

# reader.batch.explaining
source: Explaining…
ja: 精読中…
zh_hans: 精讲中…

# reader.batch.failed%lld
source: %lld failed
ja: %lld 件失敗
zh_hans: %lld 句失败

# reader.batch.retryFailed
source: Retry
ja: 再試行
zh_hans: 重试

# reader.batch.translateAll
source: Translate Whole Text
ja: 全文を翻訳
zh_hans: 全文翻译

# reader.batch.translating
source: Translating…
ja: 翻訳中…
zh_hans: 翻译中…

# reader.fontSize
source: Font Size
ja: 文字サイズ
zh_hans: 字号

# reader.mode.bilingual
source: Bilingual
ja: 対訳
zh_hans: 对照

# reader.mode.original
source: Original
ja: 原文
zh_hans: 原文

# reader.mode.translation
source: Translation
ja: 訳文
zh_hans: 译文

# reader.pane.collapse
source: Hide Explanation Pane
ja: 解説パネルを隠す
zh_hans: 收起精讲栏

# reader.pane.empty.message
source: The explanation for the sentence you tap shows up here.
ja: 本文の文をタップすると、ここに解説が表示されます。
zh_hans: 点正文里的任意一句，讲解会显示在这里。

# reader.pane.empty.title
source: Tap a sentence
ja: 文をタップ
zh_hans: 点一句看精讲

# reader.pane.expand
source: Show Explanation Pane
ja: 解説パネルを表示
zh_hans: 展开精讲栏

# reader.reading.unavailable
source: No readings available for this language yet
ja: この言語の読み仮名はまだ利用できません
zh_hans: 该语言暂无可用读音

# reader.selection.copy
source: Copy
ja: コピー
zh_hans: 复制

# reader.selection.explain
source: Explain
ja: 解説
zh_hans: 精讲

# reader.selection.favorite
source: Save word
ja: 単語登録
zh_hans: 收藏

# reader.selection.highlight
source: Highlight
ja: ハイライト
zh_hans: 划线

# reader.showReading
source: Show Readings
ja: 読み仮名を表示
zh_hans: 显示读音

# reader.untranslated
source: Not translated yet
ja: 未翻訳
zh_hans: 尚未翻译

# review.done
source: All done for today
ja: 今日は完了
zh_hans: 今日已完成

# review.doneDescription
source: No cards due right now
ja: 期限到来のカードはありません
zh_hans: 当前没有到期卡片

# review.extraRound%lld
source: Study %lld more
ja: もう %lld 枚
zh_hans: 再复习一组（%lld 张）

# review.extraRoundHint
source: Reviews cards due soon, ahead of schedule — tomorrow's queue gets shorter.
ja: もうすぐ期限のカードを前倒しで復習します。明日の分がその分減ります。
zh_hans: 提前复习最近要到期的卡，明天的队列会相应变短。

# review.gradeKnown
source: Good
ja: わかる
zh_hans: 认识

# review.gradeUncertain
source: Hard
ja: あいまい
zh_hans: 模糊

# review.gradeUnknown
source: Again
ja: わからない
zh_hans: 不认识

# review.options
source: Card options
ja: カード設定
zh_hans: 卡片设置

# review.progressNew
source: New learned
ja: 新規クリア
zh_hans: 新词已掌握

# review.progressReview
source: Reviews cleared
ja: 復習クリア
zh_hans: 复习已通过

# review.recallHint
source: Try to recall first, then reveal the answer
ja: まず思い出してから答えを表示してください
zh_hans: 先尝试回忆,再显示答案

# review.relearning%lld
source: %lld to redo
ja: 要復習 %lld 枚
zh_hans: 待巩固 %lld 张

# review.remaining%lld
source: %lld cards remaining
ja: 残り %lld 枚
zh_hans: 剩余 %lld 张

# review.showAnswer
source: Show Answer
ja: 答えを表示
zh_hans: 显示答案

# review.showReadingOnFront
source: Show reading on front
ja: 表面に読み方を表示
zh_hans: 正面显示读音

# review.title
source: Today's Review
ja: 今日の復習
zh_hans: 今日复习

# search.indexing%lld
source: Building search index (%lld left)
ja: 検索インデックスを作成中（残り %lld 件）
zh_hans: 正在建立搜索索引（还剩 %lld 篇）

# search.noResults
source: No matches
ja: 一致なし
zh_hans: 没有匹配

# search.prompt
source: Search your library
ja: ライブラリを検索
zh_hans: 搜索资源

# search.searching
source: Searching…
ja: 検索中…
zh_hans: 搜索中…

# search.section.fullText
source: In text
ja: 本文
zh_hans: 正文

# search.section.titles
source: Titles
ja: タイトル
zh_hans: 标题

# settings.about
source: About
ja: アプリについて
zh_hans: 关于

# settings.appearance
source: Appearance
ja: 外観
zh_hans: 外观

# settings.appearance.dark
source: Dark
ja: ダーク
zh_hans: 深色

# settings.appearance.light
source: Light
ja: ライト
zh_hans: 浅色

# settings.appearance.mode
source: Mode
ja: モード
zh_hans: 明暗

# settings.appearance.system
source: System
ja: システム
zh_hans: 跟随系统
